Демо_Офис.акСШП/src/InformationRegisters/сшпОчередьВходящихСообщений/сшпОчередьВходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>сшпОчередьВходящихСообщений</name>
  <comment>Очередь входящих сообщений</comment>
  <resources>
    <name>Тело</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>СтатусСообщения</name>
    <type>
      <types>EnumRef.сшпСтатусыСообщений</types>
    </type>
  </resources>
  <resources>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПоследняяОшибка</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ВРаботе</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КодОтправителяВСШП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПолучателяВСШП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапросаВСШП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияВОтправителе</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассВСШП</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <comment>Планировалось использовать определяемый тип сшпОбъектыОбмена, но в версии платформы 8.3.23.1688 не доступен в расширении.</comment>
    <type>
      <types>CatalogRef.сшпСервисыИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.сшпКлассыИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоУдаление</name>
    <comment>(зарезервировано)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторСообщенияВСШП</name>
    <comment>Идентификатор, который присваивается сообщению при его создании в сервисе интеграции.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Демо_Офис.акСШП/src/Enums/сшпСтатусыСообщений/сшпСтатусыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>сшпСтатусыСообщений</name>
  <comment>Основные статусы сообщений</comment>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>НеВалидно</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>Обработано</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаОтменена</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОбработки</name>
  </enumValues>
  <enumValues>
    <name>ОжиданиеОтправки</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаОтменена</name>
  </enumValues>
  <enumValues>
    <name>ОтправкаПодтверждена</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>ОтсутствуетОбработчик</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработки</name>
  </enumValues>
  <enumValues>
    <name>ПакетнаяОбработка</name>
  </enumValues>
</mdclass:Enum>

Демо_Офис.акСШП/src/IntegrationServices/сшпСервисИнтеграцииТест/Module.bsl
Процедура Основной_Сеть_ИзОфисаВОфисПриемникОбработкаПолученияСообщения(Сообщение, Отказ)
	
	Попытка
		
		////////////////////////////////////////////////////////////////////////////////////////////////////
		//Пишем здесь в прикладную очередь, исключая все проверки - цель: просто записать то, что получили//
		////////////////////////////////////////////////////////////////////////////////////////////////////
		
		Менеджер = РегистрыСведений.сшпОчередьВходящихСообщений.СоздатьМенеджерЗаписи();
		
		//Измерения.
		Менеджер.ИдентификаторСообщенияВСШП = Строка(Сообщение.Идентификатор);
		
		//Ресурсы.
		Менеджер.Тело			   = ПолучитьТелоСообщения(Сообщение);
		Менеджер.СтатусСообщения   = Перечисления.сшпСтатусыСообщений.Новое;
		Менеджер.КоличествоПопыток = 0;
		Менеджер.ПоследняяОшибка   = "";
		Менеджер.ВРаботе 		   = Ложь;
		
		//Реквизиты.
		Менеджер.КодОтправителяВСШП		  = Сообщение.КодОтправителя;
		Менеджер.КодПолучателяВСШП		  = Сообщение.КодПолучателя;
		Менеджер.ТипЗапросаВСШП			  = Сообщение.Параметры.Получить("ТипЗапроса");
		Менеджер.ДатаСозданияВОтправителе = Сообщение.Параметры.Получить("ДатаСоздания");
		Менеджер.КлассВСШП				  = Сообщение.Параметры.Получить("Класс");
		Менеджер.Объект		   			  = Неопределено;
		Менеджер.Класс					  = Справочники.сшпКлассыИнтеграции.ПустаяСсылка();
		Менеджер.ЭтоУдаление			  = Ложь;	//зарезервировано
		Менеджер.ДатаСоздания			  = ТекущаяДатаСеанса();
		Менеджер.ДатаОбработки			  = Дата(1, 1, 1);
		
		Менеджер.Записать(Истина);
		
	Исключение
		
		Отказ = Истина;	//оставляем сообщение в системной очереди
		
		Инфо			  = ОписаниеОшибки();
		стрИмяСобытия  	  = сшпОбщегоНазначенияПовтИсп.ИмяСобытияЖурналаРегистрации();
		УровеньСобытия 	  = УровеньЖурналаРегистрации.Ошибка;
		стрОписаниеОшибки = НСтр("ru = 'При записи сообщения с идентификатором: """ +  Сообщение.Идентификатор + """ в прикладную очередь возникла ошибка:
		|" + Инфо + "'", сшпОбщегоНазначенияПовтИсп.КодОсновногоЯзыка());
		
		ЗаписьЖурналаРегистрации(стрИмяСобытия, УровеньСобытия,, Сообщение.Идентификатор, стрОписаниеОшибки);
		
	КонецПопытки;
	
КонецПроцедуры

// Функция - Получить тело сообщения
//
// Параметры:
//  Сообщение	- Сообщение сервиса интеграции - ссылка на сообщение сервиса интеграции, которое обрабатываем.
// Возврат:
//	Тело сообщения	- Строка - строку тела сообщения в формате JSON
Функция ПолучитьТелоСообщения(Сообщение)
	
	РазмерСообщения = Сообщение.Параметры.Получить("РазмерСообщения");
	Если РазмерСообщения <> Неопределено Тогда
		
		РазмерБуфера = Число(РазмерСообщения);
		
	Иначе
		
		РазмерБуфера = 1024;
		
	КонецЕсли;
	
	Тело  = Новый БуферДвоичныхДанных(0);
	Буфер = Новый БуферДвоичныхДанных(РазмерБуфера);
	
	Поток = Сообщение.ПолучитьТелоКакПоток();
	
	Пока Истина Цикл
		
		Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);
		
		Если Прочитано > 0 Тогда
			
			Тело = Тело.Соединить(Буфер);
			
		КонецЕсли;
		
		Если Прочитано < РазмерБуфера Тогда
			
			Прервать;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело);
	
КонецФункции
